package sharedres;
import java.util.ArrayList;
import java.util.List;


//Класс-контейнер для сохранения прочитанных из файла блоков конфигурирования свитча
public class ConfBlock {
	//Стандартное значение, по которому будет происходить повторение блока конфигурирования
	public static final String DEFAULT_ITERATED_BY = "NONE";
	
	//Переменная, хранящая группу настроек, по количеству которых будет произведено повторение блока конфигурирования
	private String iteratedBy;
	
	//Список, содержащий строку конфигурирования, разбитую на элементы для быстрой сборки в переменную типа String с заменой переменных на значения настроек
	private List<List<String>> stgLines = new ArrayList<>();
	
	//Переменная, хранящая количество строк конфигурирования в объекте
	private int countOfLines = 0;
	
	//Конструктор с параметром - по какому параметру будет повторяться конфблок =====================================================================================================================
	public ConfBlock(String iteratedBy){
		this.iteratedBy = iteratedBy;
	}
	
	//Конструктор без параметра - конфблок повторяется по параметру "NONE" =====================================================================================================================
	public ConfBlock() {
		this(DEFAULT_ITERATED_BY);
	}

	//TODO Рефакторить названия, чтобы были нормальные геттеры-сеттеры
	//Getter количества строк в конфблоке ============================================================================================================================================================
	public int countOfLines(){
		return countOfLines;
	}
	
	//Getter параметра повторения конфблока ============================================================================================================================================================
	public String iteratedBy(){
		return iteratedBy;
	}
	
	//Метод добавления новой строки	============================================================================================================================================================
	public void addNewLine(){
		stgLines.add(new ArrayList<String>());
		countOfLines++;
	}
	
	//Метод добавления нового оператора в строку ============================================================================================================================================================
	public void addNewOperator(String operatorToAdd){
		stgLines.get(countOfLines - 1).add(operatorToAdd);
	}
	
	//Getter заданной строки ==========================================================================================================================================================
	public List<String> getLine (int lineIndex){
		return stgLines.get(lineIndex);
	}
}
